АлогистикТест2/src/DataProcessors/алк_РабочееМестоОператораЦЛП/алк_РабочееМестоОператораЦЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РабочееМестоОператораЦЛП</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияСортировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МассивИзЗаказаПокупателя</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатурыПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Припуск</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетовОперативный/алк_ПараметрыПакетовОперативный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетовОперативный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.алк_ЗаказНаПроизводство</types>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопАналитика</name>
    <type>
      <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <resources>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Актуальность</name>
    <type>
      <types>EnumRef.алк_ОперативнаяАктуальностьПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ОперативнаяАктуальностьПакетов/алк_ОперативнаяАктуальностьПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперативнаяАктуальностьПакетов</name>
  <enumValues>
    <name>Актуален</name>
  </enumValues>
  <enumValues>
    <name>Изменен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/DataProcessors/алк_РабочееМестоОператораЦЛП/Forms/ГенерированиеМассиваСерийныхНомеров/Module.bsl
&НаКлиенте
Процедура ТаблицаСерийныхНомеровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Характеристика") Тогда
		Характеристика = Параметры.Характеристика;	
	КонецЕсли;
	
	Если Параметры.Свойство("Смена") Тогда
		Смена = Параметры.Смена;	
	КонецЕсли;
	
	Если Параметры.Свойство("Направление") Тогда
		Направление = Параметры.Направление;	
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаСмены") Тогда
		ДатаСмены = Параметры.ДатаСмены;	
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоСостав") Тогда
		КоличествоСостав = Параметры.КоличествоСостав;	
	КонецЕсли; 
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;	
	КонецЕсли; 
	
	Если Параметры.Свойство("ШаблонСерийногоНомера") Тогда
		ШаблонСерийногоНомера = Параметры.ШаблонСерийногоНомера;	
	КонецЕсли;
	
	МассивВыбранныхПакетов = Новый Массив;
	
	Если Параметры.Свойство("МассивВыбранныхПакетов") Тогда
		Если Параметры.МассивВыбранныхПакетов <> Неопределено Тогда
			МассивВыбранныхПакетов = Параметры.МассивВыбранныхПакетов;		
		КонецЕсли;                                                    			
	КонецЕсли;
	
	й = 0;
	
	Для каждого ВыбранныйПакет Из МассивВыбранныхПакетов Цикл
		й = й + 1;
		НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
		НоваяСтрока.СерийныйНомер = ВыбранныйПакет.Ссылка;
		НоваяСтрока.НомерПакета   = Число(Сред(НоваяСтрока.СерийныйНомер, 7));
		НоваяСтрока.НомерСтроки = й; 	
	КонецЦикла; 	
	
	Если Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда		
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;   
		ЭтаФорма.Элементы.ТаблицаСерийныхНомеровСоздатьПакеты.Видимость = Ложь;
		ЭтаФорма.Элементы.ТаблицаСерийныхНомеровСоздатьПакетыПечать.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;	
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти 

Процедура Конец()
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСерийныеНомера(Команда)
	
	КоличествоГотовых = ТаблицаСерийныхНомеров.Количество();
	
	Если КоличествоГотовых <> 0 Тогда
		
		ТекстВопроса = "Уже сгенерированы " + КоличествоГотовых + " серийных номеров.
		| Хотите добавить ещё: " + КоличествоПакетов + "?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СгенерироватьСНЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		Для й = 1 По КоличествоПакетов Цикл
			
			НовыйНомерСтруктура = СгенерироватьСерийныйНомерСервер();
			
			СохраненоУспешно = СохранитьВводСерийСервер(НовыйНомерСтруктура);
			
		КонецЦикла;  		
		         		
		й = 0; 	
		Для каждого Стр Из ТаблицаСерийныхНомеров Цикл
			й = й + 1;
			Стр.НомерСтроки = й; 	
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСНЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для й = 1 По КоличествоПакетов Цикл
			
			НовыйНомерСтруктура = СгенерироватьСерийныйНомерСервер();
			
			СохраненоУспешно = СохранитьВводСерийСервер(НовыйНомерСтруктура);     			
			
		КонецЦикла;
		
		й = 0; 	
		Для каждого Стр Из ТаблицаСерийныхНомеров Цикл
			й = й + 1;
			Стр.НомерСтроки = й; 	
		КонецЦикла; 
		              	
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Функция СгенерироватьСерийныйНомерСервер()
	
	СледующийПоПорядкуНомер = ВычислитьМаксимальныйНомер()+1;
	Возврат ДобавитьСерийныйНомерПоШаблону(СледующийПоПорядкуНомер);
	
КонецФункции

&НаСервере
Функция ВычислитьМаксимальныйНомер()
	
	МаксимальныйНомерИзСправочника = Справочники.СерийныеНомера.ВычислитьМаксимальныйНомерСерии_ПоШаблону(Номенклатура, ШаблонСерийногоНомера);
	
	Номер = МаксимальныйНомерИзСправочника;
	
	Возврат Номер;
	
КонецФункции

&НаСервере
Функция ДобавитьСерийныйНомерПоШаблону(ТекущийМаксимальныйНомер)
	
	НомерЧисло = ТекущийМаксимальныйНомер;
	
	Если ЗначениеЗаполнено(ШаблонСерийногоНомера) Тогда
		//Длина цифровой части номера - не более 13 символов
		ЦифрВШаблоне = СтрЧислоВхождений(ШаблонСерийногоНомера, РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла());
		ЧислоСимволовСН = Макс(ЦифрВШаблоне, СтрДлина(НомерЧисло));
		НомерСНулями = Формат(НомерЧисло, "ЧЦ="+ЦифрВШаблоне+"; ЧВН=; ЧГ=");
		
		НовыйНомерПоШаблону = "";
		НомерСимволаСН = 1;
		//Заполняем шаблон
		Для н=1 По СтрДлина(ШаблонСерийногоНомера) Цикл
			симв = Сред(ШаблонСерийногоНомера,н,1);
			Если симв=РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла() Тогда
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+Сред(НомерСНулями,НомерСимволаСН,1);
				НомерСимволаСН = НомерСимволаСН+1;
			Иначе
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+симв;
			КонецЕсли;
		КонецЦикла;
		НовыйНомер = НовыйНомерПоШаблону;
	Иначе
		НовыйНомер = Формат(НомерЧисло, "ЧЦ=8; ЧВН=; ЧГ=");
	КонецЕсли;
	
	возврат Новый Структура("НовыйНомер, НовыйНомерЧисло", НовыйНомер, НомерЧисло);
	
КонецФункции // ДобавитьСерийныйНомерПоШаблону()

&НаСервере
Функция СохранитьВводСерийСервер(СтруктураНомераСерии)
	
	СправочникОбъект                = Справочники.СерийныеНомера.СоздатьЭлемент();
	СправочникОбъект.Владелец		= Номенклатура;
	СправочникОбъект.Наименование	= СтруктураНомераСерии.НовыйНомер;
	
	Попытка
		СправочникОбъект.Записать();	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
	НоваяСтрока.СерийныйНомер = СправочникОбъект.Ссылка;
	НоваяСтрока.НомерПакета   = СтруктураНомераСерии.НовыйНомерЧисло;
	
	Возврат Истина;
	
КонецФункции // СохранитьВводСерийСервер()	

&НаКлиенте
Процедура СоздатьПакеты(Команда)
	
	МассивПакетов = Новый Массив;
	
	Для каждого Стр Из ТаблицаСерийныхНомеров Цикл 	
		МассивПакетов.Добавить(Стр.СерийныйНомер);	
	КонецЦикла; 
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Характеристика", Характеристика);
	ПараметрыЗакрытия.Вставить("КоличествоСостав", КоличествоСостав);	
	ПараметрыЗакрытия.Вставить("МассивПакетов", МассивПакетов);
	ПараметрыЗакрытия.Вставить("ПечатьЭтикетки", Команда.Имя = "СоздатьПакетыПечать");
	
	Закрыть(ПараметрыЗакрытия);
			
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвободныеНомераНаСервере()
	
	ТаблицаСерийныхНомеров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПакетыВРаботе
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, ПериодПакета = &ПериодПакетаНачалоГода) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Направление = &Направление
		|	И НЕ алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность = &Удален
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ПериодПакета = &ПериодПакетаНачалоГода) КАК алк_ПараметрыПакетовСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	СерийныеНомера.Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	НЕ СерийныеНомера.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ПакетыВРаботе.СерийныйНомер
		|				ИЗ
		|					ВТ_ПакетыВРаботе КАК ВТ_ПакетыВРаботе)
		|	И СерийныеНомера.Владелец = &Номенклатура
		|	И СерийныеНомера.Наименование ПОДОБНО ""%-"" + &Год + ""-%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерийныеНомера.Наименование";
	
	Запрос.УстановитьПараметр("Год", Формат((ДатаСмены),"ДФ=yy"));
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("Удален", Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПериодПакетаНачалоГода", НачалоГода(ДатаСмены));
	
	Если КоличествоПакетов <> 0 Тогда 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100","ПЕРВЫЕ " + КоличествоПакетов);	
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	й = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		й = й + 1;
		НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
		НоваяСтрока.СерийныйНомер = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.НомерПакета   = Число(Сред(НоваяСтрока.СерийныйНомер, 7));
		НоваяСтрока.НомерСтроки = й;
	КонецЦикла;  
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСвободныеНомера(Команда)
	ПолучитьСвободныеНомераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьКомплектаЭтикетокНаСервере(ТабДок)
		
	МассивНомеров = Новый Массив;       
	
	Для каждого Стр Из ТаблицаСерийныхНомеров Цикл
		
		Если ПечататьС <= Стр.НомерСтроки 
			И (ПечататьПо = 0 Или ПечататьПо >= Стр.НомерСтроки) Тогда
			МассивНомеров.Добавить(Стр.СерийныйНомер); 		
		КонецЕсли;
		
	КонецЦикла;
	
	СменаНаПечать = "" + Смена + " " + СменаСтрокой;
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ТабДок = ОбъектОбработка.СформироватьПечатнуюФормуЭтикетки(МассивНомеров, ДатаСмены, СменаНаПечать, ПечатьНаПоловинеСтраницы, ПечатьНаЧетвертиСтраницы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомплектаЭтикеток(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
		
	ПечатьКомплектаЭтикетокНаСервере(ТабДок);	
	
	ТабДок.Показать();	
	
КонецПроцедуры
